; domain
;; domain_1.pddl for bimanual manipulation
;; This domain is for the pouring goal exclusively

(define (domain domain_pour)
  (:requirements :strips)

  (:types graspable - object
               hand - object
           location - object
  )

  (:predicates 
  	(at ?hand - hand ?obj - graspable)
    (enclosed ?hand - hand ?obj - graspable)
    (poured ?fromObj - graspable ?fromLoc - location ?toObj - graspable ?toLoc - location)
  )

  (:action approach
           :parameters (?hand - hand ?obj - graspable)
           :precondition (and (not (at ?hand ?obj)))
           :effect (and (at ?hand ?obj))
   )

   (:action enclose
           :parameters (?hand - hand ?obj - graspable)
           :precondition (and (at ?hand ?obj) (not (enclosed ?hand ?obj)))
           :effect (and (enclosed ?hand ?obj))
   )

   (:action pour
           :parameters (?hand1 ?hand2 - hand ?fromObj - graspable ?fromLoc - location ?toObj - graspable ?toLoc - location)
           :precondition (and (at ?hand1 ?toObj) (enclosed ?hand1 ?fromObj) (enclosed ?hand2 ?toObj) (not (enclosed ?hand1 ?toObj)) (not (enclosed ?hand2 ?fromObj)))
           :effect (and (poured ?fromObj ?fromLoc ?toObj ?toLoc))
   )
)

; problem
;; problem file: task_bimanual_3.pddl

(define (problem bimanual-prob1)
  (:domain domain_pour)
(:objects cup pitcher initial_location_handleft initial_location_handright - graspable 
            handright handleft - hand
            15 20 - location
  )

  (:init 
  	(at handleft initial_location_handleft)
    (at handright initial_location_handright)
  )

 (:goal (and (poured pitcher 15 cup 20))))

; plan
1. (approach handright pitcher)
   added: (at handright pitcher)
   goals met: 0 of 1
2. (enclose handright pitcher)
   added: (enclosed handright pitcher)
   goals met: 0 of 1
3. (approach handright cup)
   added: (at handright cup)
   goals met: 0 of 1
4. (approach handleft cup)
   added: (at handleft cup)
   goals met: 0 of 1
5. (enclose handleft cup)
   added: (enclosed handleft cup)
   goals met: 0 of 1
6. (pour handright handleft pitcher 15 cup 20)
   added: (poured pitcher 15 cup 20)
   goals met: 1 of 1
